testFiles/results_one_thread_6GB_bench/memtier_oomd_yes_freeze_best.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:       46425 ops,    1099 (avg:    1155) ops/sec, 799.89MB/sec (avg: 841.56MB/sec), 409.84 (avg: 432.55) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          105.19          ---          ---       448.78151       428.03100       634.87900       679.93500    861720.58 
Gets         1047.52         0.00      1047.52       430.93818       448.51100       655.35900       720.89500        40.83 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1152.71         0.00      1047.52       432.56205       446.46300       655.35900       720.89500    861761.40 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET     138.239        0.000
SET     364.543        5.000
SET     376.831       10.000
SET     385.023       15.000
SET     391.167       20.000
SET     395.263       25.000
SET     401.407       30.000
SET     407.551       35.000
SET     413.695       40.000
SET     419.839       45.000
SET     428.031       50.000
SET     432.127       52.500
SET     438.271       55.000
SET     444.415       57.500
SET     450.559       60.000
SET     460.799       62.500
SET     471.039       65.000
SET     481.279       67.500
SET     491.519       70.000
SET     497.663       72.500
SET     505.855       75.000
SET     509.951       76.250
SET     514.047       77.500
SET     518.143       78.750
SET     522.239       80.000
SET     528.383       81.250
SET     528.383       82.500
SET     532.479       83.750
SET     536.575       85.000
SET     544.767       86.250
SET     548.863       87.500
SET     548.863       88.125
SET     552.959       88.750
SET     552.959       89.375
SET     557.055       90.000
SET     561.151       90.625
SET     561.151       91.250
SET     565.247       91.875
SET     569.343       92.500
SET     573.439       93.125
SET     577.535       93.750
SET     581.631       94.062
SET     585.727       94.375
SET     589.823       94.688
SET     589.823       95.000
SET     593.919       95.312
SET     598.015       95.625
SET     598.015       95.938
SET     602.111       96.250
SET     606.207       96.562
SET     606.207       96.875
SET     610.303       97.031
SET     614.399       97.188
SET     614.399       97.344
SET     614.399       97.500
SET     618.495       97.656
SET     618.495       97.812
SET     622.591       97.969
SET     622.591       98.125
SET     626.687       98.281
SET     626.687       98.438
SET     630.783       98.516
SET     630.783       98.594
SET     630.783       98.672
SET     630.783       98.750
SET     634.879       98.828
SET     634.879       98.906
SET     634.879       98.984
SET     638.975       99.062
SET     638.975       99.141
SET     643.071       99.219
SET     643.071       99.258
SET     643.071       99.297
SET     647.167       99.336
SET     647.167       99.375
SET     647.167       99.414
SET     651.263       99.453
SET     651.263       99.492
SET     655.359       99.531
SET     655.359       99.570
SET     655.359       99.609
SET     655.359       99.629
SET     659.455       99.648
SET     659.455       99.668
SET     659.455       99.688
SET     663.551       99.707
SET     663.551       99.727
SET     663.551       99.746
SET     667.647       99.766
SET     667.647       99.785
SET     667.647       99.805
SET     667.647       99.814
SET     667.647       99.824
SET     667.647       99.834
SET     671.743       99.844
SET     671.743       99.854
SET     671.743       99.863
SET     671.743       99.873
SET     679.935       99.883
SET     679.935       99.893
SET     679.935       99.902
SET     688.127       99.907
SET     688.127       99.912
SET     688.127       99.917
SET     688.127       99.922
SET     688.127       99.927
SET     692.223       99.932
SET     692.223       99.937
SET     692.223       99.941
SET     692.223       99.946
SET     692.223       99.951
SET     704.511       99.954
SET     704.511       99.956
SET     704.511       99.958
SET     704.511       99.961
SET     704.511       99.963
SET     704.511       99.966
SET     704.511       99.968
SET     704.511       99.971
SET     704.511       99.973
SET     704.511       99.976
SET     712.703       99.977
SET     712.703      100.000
---
GET       1.119        0.000
GET      53.759        5.000
GET     160.767       10.000
GET     372.735       15.000
GET     391.167       20.000
GET     403.455       25.000
GET     413.695       30.000
GET     423.935       35.000
GET     430.079       40.000
GET     438.271       45.000
GET     448.511       50.000
GET     452.607       52.500
GET     458.751       55.000
GET     464.895       57.500
GET     468.991       60.000
GET     477.183       62.500
GET     485.375       65.000
GET     493.567       67.500
GET     501.759       70.000
GET     509.951       72.500
GET     520.191       75.000
GET     524.287       76.250
GET     532.479       77.500
GET     536.575       78.750
GET     540.671       80.000
GET     548.863       81.250
GET     552.959       82.500
GET     557.055       83.750
GET     561.151       85.000
GET     565.247       86.250
GET     573.439       87.500
GET     573.439       88.125
GET     577.535       88.750
GET     581.631       89.375
GET     585.727       90.000
GET     585.727       90.625
GET     589.823       91.250
GET     593.919       91.875
GET     598.015       92.500
GET     602.111       93.125
GET     606.207       93.750
GET     606.207       94.062
GET     610.303       94.375
GET     610.303       94.688
GET     614.399       95.000
GET     618.495       95.312
GET     618.495       95.625
GET     622.591       95.938
GET     622.591       96.250
GET     626.687       96.562
GET     630.783       96.875
GET     630.783       97.031
GET     634.879       97.188
GET     634.879       97.344
GET     634.879       97.500
GET     638.975       97.656
GET     638.975       97.812
GET     638.975       97.969
GET     643.071       98.125
GET     643.071       98.281
GET     647.167       98.438
GET     647.167       98.516
GET     647.167       98.594
GET     647.167       98.672
GET     651.263       98.750
GET     651.263       98.828
GET     651.263       98.906
GET     655.359       98.984
GET     655.359       99.062
GET     655.359       99.141
GET     659.455       99.219
GET     659.455       99.258
GET     659.455       99.297
GET     659.455       99.336
GET     663.551       99.375
GET     663.551       99.414
GET     663.551       99.453
GET     667.647       99.492
GET     667.647       99.531
GET     667.647       99.570
GET     671.743       99.609
GET     671.743       99.629
GET     675.839       99.648
GET     675.839       99.668
GET     679.935       99.688
GET     679.935       99.707
GET     688.127       99.727
GET     688.127       99.746
GET     692.223       99.766
GET     696.319       99.785
GET     704.511       99.805
GET     704.511       99.814
GET     704.511       99.824
GET     704.511       99.834
GET     712.703       99.844
GET     712.703       99.854
GET     712.703       99.863
GET     712.703       99.873
GET     720.895       99.883
GET     720.895       99.893
GET     720.895       99.902
GET     720.895       99.907
GET     720.895       99.912
GET     720.895       99.917
GET     729.087       99.922
GET     729.087       99.927
GET     729.087       99.932
GET     729.087       99.937
GET     729.087       99.941
GET     737.279       99.946
GET     737.279       99.951
GET     737.279       99.954
GET     737.279       99.956
GET     737.279       99.958
GET     737.279       99.961
GET     741.375       99.963
GET     741.375       99.966
GET     741.375       99.968
GET     741.375       99.971
GET     741.375       99.973
GET     741.375       99.976
GET     741.375       99.977
GET     741.375       99.978
GET     741.375       99.979
GET     741.375       99.980
GET     745.471       99.982
GET     745.471      100.000
---
WAIT      0.000      100.000
8
GET     897.023       99.979
GET     897.023      100.000
---
WAIT      0.000      100.000
    704.511       99.982
GET     704.511      100.000
---
WAIT      0.000      100.000